# Session #2
21/08/2020

- SQL
- Loops
- Functions

### Loops

In [1]:
# https://www.codewars.com/kata/55c28f7304e3eaebef0000da
    
# https://www.codewars.com/kata/55ca43fb05c5f2f97f0000fd
    
# https://www.codewars.com/kata/57cc40b2f8392dbf2a0003ce

### 1. https://www.codewars.com/kata/55c28f7304e3eaebef0000da

Approach #1 - Trying to solve it with while loops

In [2]:
def create_array(n):
    # Define the data structures + variables
    array_list = []
    i = 1
    
    # append value to new list
    while i <= n: 
        array_list.append(i)
        i += 1
        
    return array_list

In [3]:
create_array(5)

[1, 2, 3, 4, 5]

2. Approach #2 trying to solve it with for loops

In [4]:
def createarray(number):
    # Defining data structures and variables
    newArray = []
    counter = 1
    
    # append value to new list
    for num in range(1, number + 1):
        newArray.append(num)
            
    return newArray

In [5]:
createarray(5)

[1, 2, 3, 4, 5]

### 2. https://www.codewars.com/kata/55ca43fb05c5f2f97f0000fd/train/python

In [6]:
def list_animals(animals):
    list = []
    for animal in animals:
#        list += str(i + 1) + '. ' + animals[i] + '\n'
        list.append(animal)
    return list

In [7]:
list_animals(['dog', 'cat'])

['dog', 'cat']

### Unpacking

In [8]:
a = 1
b = 2
c = 3

In [9]:
d, e, f = [1, 2, 3]

In [10]:
def list_animals(animals):
    list = ''
    for i, animal in enumerate(animals):
        list += str(i + 1) + '. ' + animals[i] + '\n'
    return list

In [11]:
list_animals(['dog', 'cat'])

'1. dog\n2. cat\n'

In [12]:
def list_animals(animals):
    list = ''
    
    for i, animal in enumerate(animals):
        list += str(i + 1) + '. ' + animals[i] + '\n'
    return list

In [13]:
list_animals(['elephant', 'rat', 'dog', 'cat'])

'1. elephant\n2. rat\n3. dog\n4. cat\n'

In [14]:
print(list_animals(['elephant', 'rat', 'dog', 'cat']))

1. elephant
2. rat
3. dog
4. cat

## Pandas

In [29]:
import pandas as pd

df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})

In [30]:
df.head()

   col1  col2
0     1     3
1     2     4

### Recommended method

In [32]:
df.drop('col1', axis=1)

   col2
0     3
1     4

In [33]:
df

   col1  col2
0     1     3
1     2     4

In [34]:
df2 = df.drop('col1', axis=1)

In [35]:
df

   col1  col2
0     1     3
1     2     4

In [36]:
df2

   col2
0     3
1     4

In [20]:
df.drop('col1', axis=1, inplace=True, errors='ignore')

In [21]:
df

   col2
0     3
1     4

In [ ]:
df.drop('col1', axis=1, inplace=True)

### Accessing DataFrames

In [22]:
df.head()

   col2
0     3
1     4

In [23]:
df.columns

Index(['col2'], dtype='object')

In [24]:
df['col2']

0    3
1    4
Name: col2, dtype: int64

### Functions

### little game to practice functions

1. create a function that takes any word and:
    - lower case it
    - replaces "a", "b", "c" for 1, 2, 3

2. Ask a user if they want to end the game or contiune

3. Expected output --> ONLY 1 function